app/Controllers/UserController.php

        }

        $GenderModel = new GenderModel();
        $data['genders'] = $GenderModel->findAll();
---
SELECT *
FROM `genders`